
/*
			      ФАЙЛ  TREE.H
	     Описание констант и  структур данных   */

/* Способ использования идентификатора: */
#define TYPES      121   /* ТИП */
#define CONSTS     122   /* КОНСТАНТА */
#define VARS       123   /* ПЕРЕМЕННАЯ */
#define PROCS      124   /* ПРОЦЕДУРА */
#define FUNCS      125   /* ФУНКЦИЯ   */


//union const_val  /* значение константы */
//	{int intval;    /* целого типа */
	    // charval;   /* символьного типа */
//	int boolval;
	//char *enumval;	/* перечислимого типа ( адрес в таблице имен ) */
	//double realval;	/* вещественного типа */
//	};

