
 /* ФАЙЛ "TYPES.H"-ОБЪЯВЛЕНИЕ КОДОВ ТИПОВ */

#define SCALARS    101	/* стандартные скалярные типы			*/
#define LIMITEDS   102  /* ограниченные типы				*/
#define ENUMS      103	/* перечислимые типы				*/
#define REFERENCES 104	/* ссылочные типы				*/
#define ARRAYS     105	/* регулярные типы (массивы)			*/
#define SETS       106	/* множественные типы				*/
#define FILES      107	/* файловые типы				*/
#define RECORDS    108	/* комбинированные типы (записи)		*/
		/* прикладных вхождений переменных множественного типа  */
#define STRINGS	   110	/* строковые типы ( разновидность одномерных 	*/
		/* символьных массивов, а именно - те из них, которые 	*/
		/* имеют тип индекса, ограниченный на целом, с нижней 	*/
		/* границей 1 )						*/


﻿
